Amiya200/stm32_water_tank/Core/Src/screen.c
void Screen_Init(void)
{
    lcd_init();
    lcd_clear();
    ui = UI_WELCOME;
    last_ui = UI_NONE;
    screenNeedsRefresh = true;
    lastUserAction = HAL_GetTick();
}

static inline void refreshInactivityTimer(void)
{
    lastUserAction = HAL_GetTick();
}

static inline void lcd_line(uint8_t row, const char* s)
{
    char buf[17];
    snprintf(buf, sizeof(buf), "%-16.16s", s);
    lcd_put_cur(row, 0);
    lcd_send_string(buf);
}

static inline void lcd_line0(const char* s){ lcd_line(0,s); }
static inline void lcd_line1(const char* s){ lcd_line(1,s); }

static void show_welcome(void)
{
    lcd_line0("   HELONIX");
    lcd_line1(" IntelligentSys");
}

static void show_dash(void)
{
    char l0[17], l1[17];
    uint32_t now = HAL_GetTick();
    if (dash_cycle_start == 0)
        dash_cycle_start = now;

    uint32_t elapsed = now - dash_cycle_start;
    uint8_t  new_page;
    if      (elapsed < DASH_PAGE0_TIME)                     new_page = 0;
    else if (elapsed < (DASH_PAGE0_TIME + DASH_PAGE1_TIME)) new_page = 1;
    else  { dash_cycle_start = now; new_page = 0; }

    if (new_page != dash_page)
    {
        dash_page          = new_page;
        screenNeedsRefresh = true;
        dry_blink_slot     = 0;
        dry_blink_start    = now;
        return;
    }

    uint8_t     tankPercent    = ModelHandle_GetTankLevelPercent();
    bool        tankFull       = ModelHandle_IsTankFull();
    bool        motorOn        = Motor_GetStatus();
    DryFSMState dryFSMState    = ModelHandle_GetDryState();
    bool        dryEnabled     = ModelHandle_GetDryRunEnable();
    bool        sensorHasWater = ModelHandle_IsDryRunActive(); /* TRUE = water present */
    const char *gw             = (adcData.voltages[4] <= 0.01f) ? "YES" : "NO ";

    /* ── Update sticky flags (covers UART path where show_dash IS reached
     *    while the mode is live; button path is already handled in
     *    Screen_HandleSwitches via sticky_set_*) ──────────────────────── */
    if (semiAutoActive)   sticky_set_semi();
    if (countdownActive)  sticky_set_countdown();

    /* Any dominant active mode clears both sticky indicators */
    if (timerActive || autoActive || twistActive || manualActive ||
        ModelHandle_IsRestartActive() || ModelHandle_IsVoltageFault() ||
        ModelHandle_IsOverload()      || ModelHandle_IsUnderload())
    {
        dash_semi_shown      = false;
        dash_countdown_shown = false;
    }

    /* ── Resolve display mode string ───────────────────────────────────────
     * Priority (high→low):
     *   fault/restart > timer > auto > countdown > twist > semi > manual >
     *   tank full > sticky-countdown > sticky-semi > READY
     *
     * sticky-countdown is intentionally checked BEFORE sticky-semi so the
     * most-recently-used mode always wins the label race.
     * ──────────────────────────────────────────────────────────────────── */
    const char *mode;
    if      (ModelHandle_IsRestartActive()) mode = "Refill ";
    else if (ModelHandle_IsVoltageFault())  mode = "VOLTERR";
    else if (ModelHandle_IsOverload())      mode = "OVERLD ";
    else if (ModelHandle_IsUnderload())     mode = "UNDERLD";
    else if (timerActive)                   mode = "TIMER  ";
    else if (autoActive)       mode = motorOn ? "AUTO   " : "AUTO WT";
    else if (countdownActive)  mode = motorOn ? "COUNT  " : "CD WAIT";
    else if (twistActive)      mode = motorOn ? "TWIST  " : "TWIST W";
    else if (semiAutoActive)   mode = motorOn ? "SEMI   " : "SEMI OF";
    else if (manualActive)     mode = "MANUAL ";
    else if (tankFull)         mode = "FULL   ";
    else if (dash_countdown_shown) mode = "COUNT  ";   /* was ON, now OFF – sticky */
    else if (dash_semi_shown)      mode = "SEMI   ";   /* was ON, now OFF – sticky */
    else                           mode = "READY  ";

    if (dash_page == 0)
    {
        snprintf(l0, sizeof(l0), "%-7sM:%-3s%3d%%",
                 mode, motorOn ? "ON " : "OFF", tankPercent);

        bool dryBlink = (dryFSMState == DRY_FAULT) ||
                        (dryEnabled && motorOn && !sensorHasWater);

        bool dryTextVisible = dryBlink ? (dry_blink_slot == 0) : dryEnabled;

        if (tankFull)
        {
            snprintf(l1, sizeof(l1), "TANK FULL %02u:%02u", time.hour, time.min);
        }
        else if (senseDryRun == false)
        {
            snprintf(l1, sizeof(l1), "G.W:%-3s DRY%02u:%02u",
                     gw, time.hour, time.min);
        }
        else if (senseDryRun == true)
        {
            snprintf(l1, sizeof(l1), "G.W:%-3s    %02u:%02u",
                     gw, time.hour, time.min);
        }

        lcd_line0(l0);
        lcd_line1(l1);
    }
    else /* page 1 */
    {
        const char *dow = "---";
        if (time.dow >= 1 && time.dow <= 7)
            dow = dowNames[(time.dow - 1) % 7];

        snprintf(l0, sizeof(l0), "%02u:%02u %3.0fV %4.1fA",
                 time.hour, time.min, g_voltageV, g_currentA);
        snprintf(l1, sizeof(l1), "%-12.12s", dow);

        lcd_line0(l0);
        lcd_line1(l1);
    }
}

static void draw_menu_cursor(void)
{
    if (ui != UI_MENU) return;
    uint8_t row = 255;
    if      (menu_idx == menu_view_top)     row = 0;
    else if (menu_idx == menu_view_top + 1) row = 1;
    if (row <= 1)
    {
        lcd_put_cur(row, 0);
        lcd_send_data('>');
    }
}

static void show_menu(void)
{
    char l0[17], l1[17];
    if (menu_idx < menu_view_top)
        menu_view_top = menu_idx;
    else if (menu_idx > menu_view_top + 1)
        menu_view_top = menu_idx - 1;

    snprintf(l0, sizeof(l0), " %-15.15s", main_menu[menu_view_top]);
    if (menu_view_top + 1 < MAIN_MENU_COUNT)
        snprintf(l1, sizeof(l1), " %-15.15s", main_menu[menu_view_top + 1]);
    else
        snprintf(l1, sizeof(l1), "                ");

    lcd_line0(l0);
    lcd_line1(l1);
    draw_menu_cursor();
}

static void show_devset_menu(void)
{
    char l0[17], l1[17];
    if (devset_idx < devset_view_top)
        devset_view_top = devset_idx;
    else if (devset_idx > devset_view_top + 1)
        devset_view_top = devset_idx - 1;

    uint8_t idx0 = devset_view_top;
    uint8_t idx1 = devset_view_top + 1;

    char star0 = ' ', star1 = ' ';

