Amiya200/stm32_water_tank/Core/Src/screen.c
    if (ui == UI_COUNTDOWN && b == BTN_DOWN)
    {
        ModelHandle_StopCountdown();
        ui = UI_DASH;
        screenNeedsRefresh = true;
        return;
    }

    if (b == BTN_RESET)
    {
        if (ui == UI_DASH)
        {
            if (!ModelHandle_IsRestartActive())
                ModelHandle_StartRestart();
            else
                ModelHandle_StopRestart();
        }
        else
        {
            switch (ui)
            {
                case UI_SETTINGS_GAP:
                case UI_SETTINGS_RETRY:
                case UI_SETTINGS_UV:
                case UI_SETTINGS_OV:
                case UI_SETTINGS_OL:
                case UI_SETTINGS_UL:
                case UI_SETTINGS_MAXRUN:
                case UI_SETTINGS_PWRREST:
                case UI_SETTINGS_FACTORY:
                case UI_DEVSET_EDIT_DATE:
                case UI_DEVSET_EDIT_TIME:
                case UI_DEVSET_EDIT_DAY:
                    ui = UI_DEVSET_MENU;
                    break;
                case UI_DEVSET_MENU:
                case UI_ADD_DEVICE_MENU:
                case UI_ADD_DEVICE_PAIR:
                case UI_ADD_DEVICE_REMOVE:
                case UI_ADD_DEVICE_PAIR_DONE:
                case UI_ADD_DEVICE_REMOVE_DONE:
                    ui = UI_MENU;
                    break;
                case UI_COUNTDOWN_EDIT_MIN:
                    ui = UI_COUNTDOWN;
                    break;
                case UI_COUNTDOWN:
                    ModelHandle_StopCountdown();
                    ui = UI_DASH;
                    break;
                default:
                    ui = UI_DASH;
                    break;
            }
        }
        screenNeedsRefresh = true;
        return;
    }

    if (ui == UI_RESET_CONFIRM)
    {
        if (b == BTN_UP || b == BTN_DOWN)
            reset_confirm_yes = !reset_confirm_yes;
        else if (b == BTN_SELECT)
        {
            if (reset_confirm_yes)
            {
                ModelHandle_FactoryReset();
                edit_settings_dry_en  = ModelHandle_GetDryRunEnable() ? 1 : 0;
                edit_settings_gap_s   = ModelHandle_GetGapTime() / 60;
                edit_settings_retry   = ModelHandle_GetDryRunRetryGap() / 60;
                edit_settings_uv      = ModelHandle_GetUnderVolt();
                edit_settings_ov      = ModelHandle_GetOverVolt();
                edit_settings_maxrun  = ModelHandle_GetMaxRunTime();
                edit_settings_ol      = (int)ModelHandle_GetOverloadLimit();
                edit_settings_ul      = (int)ModelHandle_GetUnderloadLimit();
                edit_settings_pwrrest = ModelHandle_GetPowerRestoreMode();
                clear_sticky_mode_flags();
            }
            ui = UI_DASH;
        }
        screenNeedsRefresh = true;
        return;
    }

    if (ui == UI_DASH)
    {
        switch (b)
        {
            case BTN_RESET_LONG:
                ModelHandle_ToggleManual();
                break;
            case BTN_SELECT:
                if (!autoActive)
                    ModelHandle_StartAuto(edit_auto_gap_s, edit_auto_maxrun_min, edit_auto_retry);
                else
                    ModelHandle_StopAuto();
                break;
            case BTN_SELECT_LONG:
                ui = UI_MENU;
                menu_idx = 0;
                menu_view_top = 0;
                screenNeedsRefresh = true;
                return;
            case BTN_UP:
                if (autoActive)
                {
                    if (!timerActive)
                        ModelHandle_Button3_SinglePress();
                    else
                        ModelHandle_StopTimer();
                }
                screenNeedsRefresh = true;
                break;
            case BTN_UP_LONG:
                /* ── Semi-auto toggle ──────────────────────────────────────
                 * sticky_set_semi() called here so it is symmetric with the
                 * countdown path and works even if show_dash() scheduling
                 * were ever changed.
                 * ──────────────────────────────────────────────────────── */
                if (!semiAutoActive)
                {
                    ModelHandle_StartSemiAuto();
                    sticky_set_semi();          /* set sticky at start */
                }
                else
                {
                    ModelHandle_StopSemiAuto();
                }
                screenNeedsRefresh = true;
                break;
            case BTN_DOWN:
                /* ── Countdown toggle ──────────────────────────────────────
                 * sticky_set_countdown() is called HERE, BEFORE ui changes
                 * to UI_COUNTDOWN.  This is the critical fix:
                 *
                 * Once ui == UI_COUNTDOWN, show_dash() is never called while
                 * countdownActive is true (button path), so we cannot rely on
                 * show_dash() to set dash_countdown_shown in time.
                 * Setting it here guarantees the flag is correct when the
                 * user later stops the countdown and returns to the dash.
                 * ──────────────────────────────────────────────────────── */
                if (!countdownActive)
                {
                    ModelHandle_StartCountdown(edit_countdown_min * 60);
                    countdownActive = true;
                    sticky_set_countdown();     /* ← MUST be before ui changes */
                    ui = UI_COUNTDOWN;
                }
                else
                {
                    ModelHandle_StopCountdown();
                    countdownActive = false;
                    ui = UI_DASH;
                }
                screenNeedsRefresh = true;
                return;
            case BTN_DOWN_LONG:
                if (!countdownActive)
                {
                    ui = UI_COUNTDOWN_EDIT_MIN;
                    edit_countdown_min = 1;
                    screenNeedsRefresh = true;
                }
                break;
            default:
                break;
        }
        return;
    }

    if (ui == UI_MENU)
    {
        if (b == BTN_SELECT || b == BTN_SELECT_LONG) menu_select();
        else if (b == BTN_DOWN && menu_idx < MAIN_MENU_COUNT - 1) menu_idx++;
        else if (b == BTN_UP   && menu_idx > 0) menu_idx--;
        screenNeedsRefresh = true;
        return;
    }

